app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("cantidad", "categoria_id", "created_at", "isbn", "nombre", "precio", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["cantidad", 5], ["categoria_id", 1], ["created_at", "2014-06-15 22:22:06.230110"], ["isbn", "1"], ["nombre", "La mentira"], ["precio", 123.0], ["updated_at", "2014-06-15 22:22:06.230110"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "nombre" = ?, "updated_at" = ? WHERE "books"."id" = 3  [["nombre", "LOLOLO"], ["updated_at", "2014-06-26 15:06:43.538927"]]

  def find
    respond_to do |format|
      if params[:isbn]
        @book = Book.find_by isbn: params[:isbn]
---
SELECT  "books".* FROM "books"  WHERE "books"."isbn" = '123' LIMIT 1