app/controllers/costumers_controller.rb

  def index
    if params[:search]
      @costumers = Costumer.where("nombre LIKE '%"+params[:search]+"%'")

    if @costumers.size.zero?
---
SELECT "costumers".* FROM "costumers"  WHERE (nombre LIKE '%marco%')
SELECT "costumers".* FROM "costumers"
SELECT COUNT(*) FROM "costumers"  WHERE (nombre LIKE '%marco%')

  def create
    @costumer = Costumer.new(costumer_params)

    respond_to do |format|
      if @costumer.save
---
INSERT INTO "costumers" ("correoE", "created_at", "diraccion", "facebook", "linkedin", "nombre", "rfc", "telefono", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @costumer.update(costumer_params)
---
UPDATE "costumers" SET "correoE" = ?, "diraccion" = ?, "facebook" = ?, "linkedin" = ?, "nombre" = ?, "rfc" = ?, "telefono" = ?, "updated_at" = ? WHERE "costumers"."id" = 4

  def destroy
    @costumer.destroy
---
DELETE FROM "costumers" WHERE "costumers"."id" = ?  [["id", 2]]

  def findRFC
    respond_to do |format|
      if params[:rfc]
        @costumer = Costumer.find_by rfc: params[:rfc]
---
SELECT  "costumers".* FROM "costumers"  WHERE "costumers"."rfc" = '123' LIMIT 1

    def set_costumer
      @costumer = Costumer.find(params[:id])
---
SELECT  "costumers".* FROM "costumers"  WHERE "costumers"."id" = ? LIMIT 1  [["id", 2]]