app/controllers/employees_controller.rb

INSERT INTO "employees" ("created_at", "nombre", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-08 08:48:54.895386"], ["nombre", "Ana"], ["updated_at", "2014-07-08 08:48:54.895386"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save