app/controllers/orders_controller.rb

INSERT INTO "orders" ("cliente_id", "created_at", "estado", "fechaEntrega", "fechaPedido", "fechaRealEntrega", "updated_at", "usuario_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)
    costumer = Costumer.new(costumer_params)
    #al recibir los datos, comprobar si existe el cliente, entonces se pueden actualizar sus datos
    # si no existe el cliente, registrar un nuevo

    puts "Datos recibidos de la nueva venta"
 #   @sale.client.nombre = client.nombre ##si el cliente ya existe, se actualiza al nuevo valor recibido
    puts "Cliente>> " + @order.cliente_id.to_s # + @order.costumer.nombr
    puts "Productos recibidos: "

    @order.orderDs.each do |item|
    # #params[:saledetails].each do |item|
       puts "id: " + item.product_id.to_s + ", p. u: " + item.precioUnitario.to_s + ", cantidad: " + item.cantidad.to_s +
        ", importe: " + item.importeTotal.to_s
    end

     respond_to do |format|
      if @order.save