app/controllers/promotions_controller.rb

  def index
    @promotions = Promotion.all
---
SELECT "promotions".* FROM "promotions"

  def create
    @promotion = Promotion.new(promotion_params)

    respond_to do |format|
      if @promotion.save
---
INSERT INTO "promotions" ("costumer_id", "created_at", "descripcion", "employee_id", "fecha", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @promotion.destroy
---
DELETE FROM "promotions" WHERE "promotions"."id" = ?  [["id", 3]]

    def set_promotion
      @promotion = Promotion.find(params[:id])
---
SELECT  "promotions".* FROM "promotions"  WHERE "promotions"."id" = ? LIMIT 1  [["id", 3]]