app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all

SELECT  "sales".* FROM "sales"  WHERE "sales"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_sale
      @sale = Sale.find(params[:id])